GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>

#include <board.h>
#include <rtthread.h>
#include <finsh.h>

#include "stm32f4xx.h"
#include "jt808.h"
#include "jt808_gps.h"
#include "jt808_param.h"
#include "rtc.h"
#include "jt808_util.h"
#include "jt808_vehicle.h"
#include "jt808_area.h"
#include "menu_include.h"
#include "jt808_gps_pack.h"
#include "vdr.h"
#include "math.h"

#define BIT( n ) ( 1 << n )

typedef struct _GPSPoint
{
	int sign;
	int deg;
	int min;
	int sec;
} GPSPoint;

uint32_t gps_sec_count = 0;                         /*gps秒脉冲输出*/

/*要用union类型保存，位域，访问吗?*/
uint32_t		jt808_alarm			= 0x0;
uint32_t		jt808_alarm_last	= 0x0;          /*上一次的上报状态*/

uint32_t		jt808_status		= 0x0;
uint32_t		jt808_status_last	= 0x0;          /*上一次的状态信息*/

static uint32_t jt808_report_interval	= 60;       /*GPS上报时间间隔，为0:停止上报*/
static uint32_t jt808_report_distance	= 1000;     /*GPS上报距离间隔,为0 停止上报*/

static float	distance		= 0;                /*定距上报当前距离值*/
static uint32_t total_distance	= 0;                /*总的累计里程*/

uint16_t		jt808_8202_track_interval	= 0;    /*jt808_8202 临时位置跟踪控制*/
uint32_t		jt808_8202_track_duration	= 0;
uint16_t		jt808_8202_track_counter;

uint32_t		jt808_8203_manual_ack_seq	= 0;    /*人工确认报警的标识位 0,3,20,21,22,27,28*/
uint16_t		jt808_8203_manual_ack_value = 0;

#if 0


/*
   区域的定义,使用list关联起来，如果node过多的话，
   RAM是否够用
   使用dataflash存储，以4k作为cache,缓存访问
   每秒的位置信息都要判断
 */
struct
{
	uint32_t	id;                 /*区域ID*/
	uint16_t	attr;               /*属性*/
	uint32_t	latitude;           /*中心纬度*/
	uint32_t	logitude;           /*中心经度*/
	uint32_t	radius;             /*半径*/
	uint8_t		datetime_start[6];  /*开始时刻，使用utc是不是更好?*/
	uint8_t		datetime_end[6];
	uint16_t	speed;
	uint8_t		duration;           /*持续时间*/
} circle;

struct
{
	uint32_t	id;                 /*区域ID*/
	uint16_t	attr;               /*属性*/
	uint32_t	latitude;           /*中心纬度*/
	uint32_t	logitude;           /*中心经度*/
	uint32_t	radius;             /*半径*/
	uint8_t		datetime_start[6];  /*开始时刻，使用utc是不是更好?*/
	uint8_t		datetime_end[6];
	uint16_t	speed;
	uint8_t		duration;           /*持续时间*/
} rectangle;

#endif

uint32_t	gps_lati;
uint32_t	gps_longi;
uint16_t	gps_speed;

uint16_t	gps_cog; /*course over ground*/
uint16_t	gps_alti;
uint8_t		gps_datetime[6];

/*记录上一次的位置，用来计算距离用*/
static uint32_t gps_lati_last	= 0;
static uint32_t gps_longi_last	= 0;

/*保存gps基本位置信息*/
GPS_BASEINFO	gps_baseinfo;
/*gps的状态*/
GPS_STATUS		gps_status = { 0x3020, MODE_BDGPS, 0, 0, 0 };


/*
   Epoch指的是一个特定的时间：1970-01-01 00:00:00 UTC
   UNIX时间戳：Unix时间戳（英文为Unix time, POSIX time 或 Unix timestamp）
   是从Epoch（1970年1月1日00:00:00 UTC）开始所经过的秒数，不考虑闰秒。

 */

uint32_t	utc_now		= 0;
MYTIME		mytime_now	= 0;

uint8_t		ACC_status;     /*0:ACC关   1:ACC开  */
uint32_t	ACC_ticks;      /*ACC状态发生变化时的tick值，此时GPS可能未定位*/

uint32_t	gps_notfixed_count = 0;

struct
{
	uint8_t		mode;       /*上报模式 0:定时 1:定距 2:定时定距*/
	uint8_t		userlogin;  /*是否使用登录*/
	uint32_t	time_unlog;
	uint32_t	time_sleep;
	uint32_t	time_emg;
	uint32_t	time_default;
	uint32_t	distance_unlog;
	uint32_t	distance_sleep;
	uint32_t	distance_emg;
	uint32_t	distance_default;

	uint32_t	last_tick;      /*上一次上报的时刻*/
	uint32_t	last_distance;  /*上一次上报时的里程*/
} jt808_report;

#define DEBUG_GPS

#ifdef DEBUG_GPS
uint8_t		speed_add	= 0;
uint32_t	speed_count = 0;
#endif

/*hmi最近15分钟速度*/
static void process_hmi_15min_speed( void )
{
	static uint8_t	hmi_15min_speed_count	= 0;                                    /*·??ó?úμ?????êy*/
	static uint32_t hmi_15min_speed_sum		= 0;                                    /*?ù?èà??óoí*/
	if( ( mytime_now & 0xFFFFFFC0 ) != hmi_15min_speed[hmi_15min_speed_curr].time ) /*D?ê±?ì,??è·μ?·??ó*/
	{
		if( hmi_15min_speed[hmi_15min_speed_curr].time != 0 )                       /*ê?òa?2??*/
		{
			//hmi_15min_speed[hmi_15min_speed_curr].speed=hmi_15min_speed_sum/hmi_15min_speed_count;
			hmi_15min_speed_curr++;
			hmi_15min_speed_curr	%= 15;
			hmi_15min_speed_sum		= 0;
			hmi_15min_speed_count	= 0;
		}
	}
	hmi_15min_speed[hmi_15min_speed_curr].time	= mytime_now & 0xFFFFFFC0;
	hmi_15min_speed_sum							+= gps_speed;
	hmi_15min_speed_count++;
	hmi_15min_speed[hmi_15min_speed_curr].speed = hmi_15min_speed_sum / hmi_15min_speed_count; /*??ê±?üD?*/
}

/*
   通过gps语句触发的1秒定时
   未定位时也有疲劳驾驶
 */
static void adjust_mytime_now( void )
{
	uint8_t year, month, day, hour, minute, sec;

	if( mytime_now ) /*mytime_now经过gps定位后的授时*/
	{
		sec		= SEC( mytime_now );
		minute	= MINUTE( mytime_now );
		hour	= HOUR( mytime_now );
		day		= DAY( mytime_now );
		month	= MONTH( mytime_now );
		year	= YEAR( mytime_now );
		sec++;

		if( sec == 60 )
		{
			sec = 0;
			minute++;
		}
		if( minute == 60 )
		{
			minute = 0;
			hour++;
		}
		if( hour == 24 )
		{
			hour = 0;
			day++;
		}
		if( ( month == 4 ) || ( month == 6 ) || ( month == 9 ) || ( month == 11 ) )
		{
			if( day == 31 )
			{
				day = 1;
				month++;
			}
		}else if( month == 2 )
		{
			if( year % 4 == 0 ) /*闰年29天*/
			{
				if( day == 30 )
				{
					day = 1;
					month++;
				}
			}else
			{
				if( day == 29 )
				{
					day = 1;
					month++;
				}
			}
		}else if( day == 32 )
		{
			day = 1;
			month++;
		}
		if( month == 13 )
		{
			month = 1;
			year++;
		}
		mytime_now = MYDATETIME( year, month, day, hour, minute, sec );
	}
}

/*
   Linux源码中的mktime算法解析
 */
static __inline unsigned long linux_mktime( unsigned int year, unsigned int mon,
                                            unsigned int day, unsigned int hour,
                                            unsigned int min, unsigned int sec )
{
	if( 0 >= (int)( mon -= 2 ) )    /**//* 1..12 -> 11,12,1..10 */
	{
		mon		+= 12;              /**//* Puts Feb last since it has leap day */
		year	-= 1;
	}

