GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
/*
   补报数据更新原先的并读取新纪录
   每次收到中心应答后调用
   每次重新拨号成功后都要从新确认一下
   区分首次读还是上报中的读记录

   使用0704上报，要拼包
 */
void jt808_report_get( void )
{
	GPS_REPORT_HEAD head;
	uint8_t			buf[1024];              /*单包上报的字节不大于256*/
	uint32_t		i;
	uint32_t		addr;
	uint16_t		get_size;               /*获取记录的大小*/
	uint16_t		pos;
	uint8_t			count;
	if( report_count == 0 )                 /*没有有未上报记录*/
	{
		return;
	}

	if( gsm_socket[0].state != CONNECTED )  /*不在线*/
	{
		return;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 5 );

	if( report_first == 0 )                 /*不是首条上报,需要删除本次记录*/
	{
		for( i = 0; i < report_get_count; i++ )
		{
			sst25_read( report_get[i].addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
			if( head.mn == 0x474E5353 )     /*有效记录*/
			{
				head.attr = ATTR_REPORTED;  /*已发送*/
				sst25_write_through( report_get[i].addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
			}
			if( report_count )
			{
				report_count--;             /*未上报记录数-1*/
			}
		}
	}
	report_first = 0;

/*批量查找记录*/
	addr				= report_get_addr;
	report_get_count	= 0;
	get_size			= 3;
	pos					= 3;                            /*0x0704数据包，开始的偏移*/
	count				= report_count;
	if( report_count > 10 )                             /**/
	{
		count = 10;
	}
	for( i = 0; i < DF_POSTREPORT_SECTORS * 64; i++ )   /*每记录64字节,每sector(4096Byte)有64记录*/
	{
		sst25_read( addr, (uint8_t*)&head, sizeof( GPS_REPORT_HEAD ) );
		if( head.mn == 0x474E5353 )                     /*有效记录*/
		{
			if( head.attr >= ATTR_ONNET_NOREPORT )      /*还没有发送*/
			{
				report_get_count++;
				if( report_get_count > count )
				{
					report_get_addr = addr;
					break;
				}
				get_size += ( 2 + head.len );
				if( get_size > 1023 )
				{
					report_get_addr = addr;
					break;
				}
				buf[pos]		= head.len >> 8;
				buf[pos + 1]	= head.len;
				sst25_read( addr + 12, buf + pos + 2, head.len );
				pos += ( head.len + 2 );
			}
		}
		addr += 64;
		if( addr >= DF_POSTREPORT_END )
		{
			addr = DF_POSTREPORT_START;
		}
	}

	if( report_get_count )
	{
		buf[0]	= report_get_count >> 8;
		buf[1]	= report_get_count & 0xff;
		buf[2]	= 1;
		jt808_tx( 0x0704, buf, pos );
	}

	rt_sem_release( &sem_dataflash );
	rt_kprintf( "\n%d>(%d)读出位置:%x,记录数:%d,长度", rt_tick_get( ), report_count, report_get_count, pos );
}

/*
   处理gps信息,有多种条件组合，上报
   此时已收到争取的
 */

#define FLAG_SEND_AREA			0x80
#define FLAG_SEND_STATUS		0x01
#define FLAG_SEND_ALARM			0x02
#define FLAG_SEND_FIX_TIME		0x04
#define FLAG_SEND_FIX_DISTANCE	0x08


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void process_gps_report( void )
{
	static uint32_t utc_report_last = 0;
	uint32_t		tmp;
	uint8_t			flag_send	= 0; /*默认不上报*/
	uint8_t			*palarmdata = RT_NULL;
	uint16_t		alarm_length;
	uint32_t		alarm_bits;

	uint8_t			buf[300];

/*区域路线处理*/
	alarm_bits = area_get_alarm( palarmdata, &alarm_length );
	if( alarm_bits ) /*有告警*/
	{
		rt_kprintf( "\n区域有告警" );
		memcpy( buf + 28, palarmdata, alarm_length );
		flag_send = FLAG_SEND_AREA;
	}
	jt808_alarm			|= alarm_bits;
	gps_baseinfo.alarm	= BYTESWAP4( jt808_alarm );
	gps_baseinfo.status = BYTESWAP4( jt808_status );
	memcpy( buf, (uint8_t*)&gps_baseinfo, 28 );

/*中心追踪,直接上报，并返回*/
	if( jt808_8202_track_duration ) /*要追踪*/
	{
		jt808_8202_track_counter++;
		if( jt808_8202_track_counter >= jt808_8202_track_interval )
		{
			jt808_8202_track_counter = 0;
			jt808_tx( 0x0200, buf, 28 + alarm_length );
			if( jt808_8202_track_duration > jt808_8202_track_interval )
			{
				jt808_8202_track_duration -= jt808_8202_track_interval;
			}else
			{
				jt808_8202_track_duration = 0;
			}
		}
		return;
	}

/*数据上报方式,如何组合出各种情况 */
	tmp = jt808_status ^ jt808_status_last;
	if( tmp )                                           /*状态发生变化，要上报,*/
	{
		flag_send |= FLAG_SEND_STATUS;
	}
	/*不理解这个登录状态*/
	if( tmp & BIT_STATUS_ACC )                          /*ACC变化,修改汇报的间隔或距离*/
	{
		jt808_report_distance	= 0;
		jt808_report_interval	= 0;
		if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 )   /*有定时上报*/
		{
			if( jt808_status & BIT_STATUS_ACC )         /*当前状态为ACC开*/
			{
				jt808_report_interval = jt808_param.id_0x0029;
			}else
			{
				jt808_report_interval = jt808_param.id_0x0027;
			}
			utc_report_last = utc_now;                  /*重新计时*/
		}
		if( jt808_param.id_0x0020 )                     /*有定距上报*/
		{
			if( jt808_status & BIT_STATUS_ACC )         /*当前状态为ACC开*/
			{
				jt808_report_distance = jt808_param.id_0x002C;
			}else
			{
				jt808_report_distance = jt808_param.id_0x002E;
			}
			distance = 0;                               /*重新计算距离*/
		}
	}

	tmp = ( jt808_alarm ^ jt808_alarm_last );           /*告警位变化*/
	if( tmp )                                           /*告警发生变化，要上报,*/
	{
		flag_send |= FLAG_SEND_ALARM;
	}

	if( tmp & BIT_ALARM_EMG )                           /*紧急告警*/
	{
		if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 )   /*有定时上报*/
		{
			jt808_report_interval	= jt808_param.id_0x0028;
			utc_report_last			= utc_now;
		}
		if( jt808_param.id_0x0020 )                     /*有定距上报*/
		{
			jt808_report_distance	= jt808_param.id_0x002F;
			distance				= 0;
		}
	}

/*计算定时上报*/
	if( ( jt808_param.id_0x0020 & 0x01 ) == 0x0 ) /*有定时上报*/
	{
		if( utc_now - utc_report_last >= jt808_report_interval )
		{
			flag_send		|= FLAG_SEND_FIX_TIME;
			utc_report_last = utc_now;
		}
	}
/*计算定距上报*/
	if( jt808_param.id_0x0020 ) /*有定距上报*/
	{
		if( distance >= jt808_report_distance )
		{
			flag_send	|= FLAG_SEND_FIX_DISTANCE;
			distance	= 0;
		}
	}

	jt808_status_last	= jt808_status;
	jt808_alarm_last	= jt808_alarm;

/*生成要上报的数据,在线时直接上报，还是都暂存再上报，后者。*/
#if 1
	if( flag_send )
	{
		jt808_report_put( buf, 28 + alarm_length );
	}
#endif

#if 0
	if( flag_send )
	{
		jt808_tx( 0x0200, buf, 28 + alarm_length );
		rt_kprintf( "\n%d>上报gps(%02x)", rt_tick_get( ), flag_send );
	}
#endif
}

/*
   $GNRMC,074001.00,A,3905.291037,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNTXT,01,01,01,ANTENNA OK*2B7,N,11733.138255,E,0.1,,171212,,,A*655220.9*3F0E
   $GNGGA,074002.00,3905.291085,N,11733.138264,E,1,11,0.9,8.2,M,-1.6,M,,,1.4*68E
   $GNGLL,3905.291085,N,11733.138264,E,074002.00,A,0*02.9,8.2,M,-1.6,M,,,1.4*68E
   $GPGSA,A,3,18,05,08,02,26,29,15,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*3F8E
   $BDGSA,A,3,04,03,01,07,,,,,,,,,,,,,,,,,,,,,,,,,,,,,1.6,0.9,1.4,0.9*220.9*3F8E
   $GPGSV,2,1,7,18,10,278,29,05,51,063,08,21,052,24,02,24,140,45*4C220.9*3F8E
   $GPGSV,2,2,7,26,72,055,24,29,35,244,37,15,66,224,37*76,24,140,45*4C220.9*3F8E
   $BDGSV,1,1,4,04,27,124,38,03,42,190,34,01,38,146,37,07,34,173,35*55220.9*3F8E

   返回处理的字段数，如果正确的话
 */

