GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808_gps.c
				return 0;
		}
		count	= 0;
		buf[0]	= 0;
	}
	return 10;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
uint8_t process_gga( uint8_t * pinfo )
{
	//检查数据完整性,执行数据转换
	uint8_t		NoSV;
	uint8_t		i;
	uint8_t		buf[20];
	uint8_t		commacount	= 0, count = 0;
	uint8_t		*psrc		= pinfo + 7; //指向开始位置
	uint16_t	altitute;

	while( *psrc++ )
	{
		if( *psrc != ',' )
		{
			buf[count++]	= *psrc;
			buf[count]		= 0;
			continue;
		}
		commacount++;
		switch( commacount )
		{
			case 1: /*时间处理 */
				if( count < 6 )
				{
					return 1;
				}
				break;

			case 2: /*纬度处理ddmm.mmmmmm*/
				break;

			case 3: /*N_S处理*/
				break;

			case 4: /*经度处理*/

				break;
			case 5: /*E_W处理*/
				break;
			case 6: /*定位类型*/
				break;
			case 7: /*NoSV,卫星数*/
				if( count < 1 )
				{
					break;
				}
				NoSV = 0;
				for( i = 0; i < count; i++ )
				{
					NoSV	= NoSV * 10;
					NoSV	+= ( buf[i] - 0x30 );
				}
				gps_status.NoSV = NoSV;
				break;
			case 8: /*HDOP*/
				return 0;

			case 9: /*MSL Altitute*/
				if( count < 1 )
				{
					break;
				}
				altitute = 0;
				for( i = 0; i < count; i++ )
				{
					if( buf[i] == '.' )
					{
						break;
					}
					altitute	= altitute * 10;
					altitute	+= ( buf[i] - '0' );
				}
				gps_baseinfo.altitude	= altitute;
				gps_alti				= altitute;
				return 0;
		}
		count	= 0;
		buf[0]	= 0;
	}
	return 9;
}

/***********************************************************
* Function:
* Description:gps收到信息后的处理，头两个字节为长度
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_rx( uint8_t * pinfo, uint16_t length )
{
	uint8_t ret;
	char	* psrc;
	psrc = (char*)pinfo;

	*( psrc + length ) = 0;
	/*是否输出原始信息*/
	if( gps_status.Raw_Output )
	{
		rt_kprintf( "\n%d gps<%s", rt_tick_get( ), psrc );
	}
	/*保存RAW数据*/
	//jt808_gps_pack( (char*)pinfo, length );

	if( strncmp( psrc + 3, "GGA,", 4 ) == 0 )
	{
		if( strncmp( psrc + 1, "GN", 2 ) == 0 )
		{
			gps_status.mode = MODE_BDGPS;
		}else if( strncmp( psrc + 1, "GP", 2 ) == 0 )
		{
			gps_status.mode = MODE_GPS;
		}else if( strncmp( psrc + 1, "BD", 2 ) == 0 )
		{
			gps_status.mode = MODE_BD;
		}
		process_gga( (uint8_t*)psrc );
	}

	if( strncmp( psrc + 3, "RMC,", 4 ) == 0 )
	{
		gps_sec_count++;
		ret = process_rmc( (uint8_t*)psrc );

		if( ret == 0 )                          /*已定位*/
		{
			gps_notfixed_count = 0;
			process_hmi_15min_speed( );         /*最近15分钟速度*/
			vdr_rx_gps( );                      /*行车记录仪数据处理*/
			area_process( );                    /*区域线路告警*/
			calc_distance( );
		}else
		{
			adjust_mytime_now( );               /*调整mytime_now*/
			gps_notfixed_count++;
		}
		process_gps_report( );                  /*处理GPS上报信息*/
	}


	/*天线开短路检测 gps<
	   $GNTXT,01,01,01,ANTENNA OK*2B
	   $GNTXT,01,01,01,ANTENNA OPEN*3B
	 */
	if( strncmp( psrc + 3, "TXT", 3 ) == 0 )
	{
		if( jt808_param.id_0xF013 != 0x3017 )   /*型号不对,保存新的，并重启*/
		{
			rt_kprintf( "\njt808_param.id_0xF013=%04x", jt808_param.id_0xF013 );
			jt808_param.id_0xF013 = 0x3017;
			param_save( );
			reset( 0xff );
		}
		if( strncmp( psrc + 24, "OK", 2 ) == 0 )
		{
			gps_status.Antenna_Flag = 0;
			jt808_alarm				&= ~( BIT_ALARM_GPS_OPEN | BIT_ALARM_GPS_SHORT );
		}else if( strncmp( psrc + 24, "OPEN", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_alarm				|= BIT_ALARM_GPS_OPEN; /*bit5 天线开路*/
		}else if( strncmp( psrc + 24, "SHORT", 4 ) == 0 )
		{
			gps_status.Antenna_Flag = 1;
			jt808_alarm				|= BIT_ALARM_GPS_SHORT;
		}
	}
}

/*初始化jt808 gps相关的处理*/
void jt808_gps_init( void )
{
	jt808_report_init( );   /*上报区域初始化*/
	jt808_vehicle_init( );  /*车辆信息初始化*/
	area_init( );
	gps_pack_init( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gps_dump( uint8_t mode )
{
	gps_status.Raw_Output = ~gps_status.Raw_Output;
}

FINSH_FUNCTION_EXPORT( gps_dump, dump gps raw info );

/************************************** The End Of File **************************************/

#ifdef DEBUG_GPS
/**模拟调试gps速度*/
void gps_speed_add( uint8_t sp, uint32_t count )
{
	speed_add	= sp;
	speed_count = count;
}

FINSH_FUNCTION_EXPORT_ALIAS( gps_speed_add, gps_speed, debug gps speed );
#endif

/************************************** The End Of File **************************************/
